Zyed816/STM32/STM32Project/8-1DMADataTransfer/System/myDMA.c
#include "stm32f10x.h"                  // Device header

uint16_t myDMA_Size;

void myDMA_Init(uint32_t AddrA, uint32_t AddrB, uint16_t Size)
{
	myDMA_Size = Size;
	// 开启时钟
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
	
	// DMA初始化
	DMA_InitTypeDef DMA_InitStructure;
	DMA_StructInit(&DMA_InitStructure);
	DMA_InitStructure.DMA_PeripheralBaseAddr = AddrA;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
	DMA_InitStructure.DMA_MemoryBaseAddr = AddrB;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
	DMA_InitStructure.DMA_BufferSize = Size;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Enable;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_Init(DMA1_Channel1, &DMA_InitStructure);
	
	// 使能DMA
	DMA_Cmd(DMA1_Channel1, DISABLE);
}

void myDMA_Transfer(void)
{
	// 关闭DMA
	DMA_Cmd(DMA1_Channel1, DISABLE);
	
	// 设置传输计数器
	DMA_SetCurrDataCounter(DMA1_Channel1, myDMA_Size);
	
	// 使能DMA
	DMA_Cmd(DMA1_Channel1, ENABLE);
	
	// 等待转运完成
	while(DMA_GetFlagStatus(DMA1_FLAG_TC1) != SET);
	// 清除标志位
	DMA_ClearFlag(DMA1_FLAG_TC1);
}
